// 
#include <iostream>
using namespace std;

/* ----具体要求----
   1、不允许添加其它头文件
   2、不允许定义全局变量、静态局部变量（不包括宏定义、全局const变量）
   3、允许添加自定义函数
   ---------------------------------------------------------------------
*/

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int cal(int a,int n,int b)
{
	int m1, m2, m3, m4, m5, s1;
	bool y=0;
	for (int i = 0;i < n;i++) {
		m1 = a / 10000;
		m2 = (a % 10000) / 1000;
		m3 = (a % 1000) / 100;
		m4 = (a % 100) / 10;
		m5 = a % 10;
		s1 = m1 + m2 + m3 + m4 + m5;
	}
	if (s1 < 10) {
		if (s1 == b) {
			y = 1;
		}
		else {
			y = 0;
		}
		return y;
	}
	else {
		return cal(s1, n, b);
	}
}
int main()
{
	cout << "请输入数据的个数[1..10000]" << endl;
	int a[10000]={0}, n, b,j=0;
	cin >> n;
	cout << "请输入" << n << "个正整数" << endl;
	for (int i = 0;i < n;i++) {
		cin >> a[i];
	}
	cout << "请输入要统计的基数[1..9]" << endl;
	cin >> b;
	for (int i = 0;i < n;i++) {
		if (cal(a[i], n, b)) {
			j++;
		}

	}
	cout << n << "个数中迭代累加后值为" << b << "的数字的个数 : " << j << endl;
	return 0;
}

